{"title": "Hannah Senesh Just Got a Little Bit Greener", "article": "Have you ever looked at the roof or side yard and felt overwhelmed by the amount of trash? Well, a group of students at Hannah Senesh have decided to take action!\r<br><br> \t The Green Team is a group that meets once a week on Thursdays and talks about what we can do to help our environment. The Green Team is a group for aspiring environmentalists, to  …\r<br><br>“We are the first generation to feel the impact of climate change and the last generation that can do something about it,”-- said Barack Obama. This quote relates to one of the Green Team’s major goals- to make the biggest impact because making the school a green place is very important. Even though one school’s actions can’t change the world, if every school does something to make their school more environmentally friendly, the whole world will collectively get a little greener. When asked the question “Why do you think the green team is important?“, Green Team member Sophia Konviser said, “The Green team is important to our school because by having a green team, we can educate a new generation.” \r<br><br>We can all help the environment by joining the green team. While you are in the green team you can change our school and our earth. If you don’t want to join the Green Team you can help you compost, recycle, pick up trash, and more!   \r<br><br>This environmental club was started by Ariella, and a select few who were the student base of the team. Later, the team will be joined by Lauren. When Ariella was asked why she started this club, she said, “I know that there was a lot of student interest in making our community more green, so I put together this club to bring the student voices to light.”\r<br><br>\tWe must take action to protect our planet, which is facing deadly environmental threats. One example is the hole in the Ozone Layer, which has resulted in the greenhouse effect. The greenhouse effect is essentially turning our planet into a \"greenhouse,\" where the sun's heat fills our atmosphere and gradually heats our biosphere. This heat cannot escape and will create a rise in temperatures. Currently, global temperatures have risen at an average rate of 0.17°F per decade since 1901. Although it may not seem like a large amount, slowly over time, our planet's temperature will continue to rise. Another example of environmental threats is happening closer to home. Around 200 to 2,000 species, or 0.1 to 1% of animals, become extinct each year, and much of this is due to human activity and habitat loss. If we don't act now, animals such as mountain gorillas, orangutans, and amur leopards will become extinct soon. These problems may seem overwhelming, but raising awareness and getting people's support will be key factors in this long journey.\r<br><br>To make the Green Team’s aspiration a reality, we all need to work together. Even if you aren't that passionate about the environment, try coming to a Green Team meeting or just doing something as small as picking up a piece of trash. Every little thing matters. ", "author": "Ava Samuels and Almah Zach", "src": "schoolevents/imgs/Hannah Senesh Just Got a Little Bit Greener.jpeg", "date": "2024-02-01 22:46:05.147374"}