{"title": "The Tubishvat Fair and Sustainability Outside of Senesh", "article": "On Thursday, the school gathered for the Tu Bishvat Fair in honor of Tu Bishvat which started on Friday night. As the grades walked in everyone stared in amazement! The 6th graders, the leaders and creators of the fair, had created interactive, and fun games centered around sustainability. I decided to interview some 6th grade booth creators as well as other students from 3rd to 8th grade. I was surprised to find that almost none of the students worked on sustainability outside of Hannah Senesh. One 6th grader said he did “nothing” for climate change and “did not care a lot about it.” This is surprising to me because Senesh’s 6th grade goal is to teach students about caring for the environment and why you should care about it at all.\r\n</br> </br> Another 6th grader I sat down with told me that he “donated to plant trees,” but that he “does not like it but does not care a lot.” Why is this? Why does almost everyone not do much about climate change? To try and answer this question I sat down with an 8th grader and asked them the same questions I asked the 6th graders. They told me that their family recycles. I asked if they composted too, but they replied that their apartment building had no place to put their food scraps. \r\n</br></br> So, it turns out that it’s not the students fault for knowing and doing so little. Our entire world is built off of trash and plastic and anyone who wants to make a difference is unable to because of the way the world runs. \r\nSo how can we fix this? The simple answer is our school can’t. The long answer though is that by teaching everyone we meet about the problems that face Earth we might make a difference. \r\nIf everyone works together we can change the world. If you want to fight climate change then try and get involved. Plant trees, compost, go to marches and even just get informed and share that information. We only have one world. And we have to save it!\r\n", "author": "Adam Bellows", "src": "schoolevents/imgs/The Tubishvat Fair and Sustainability Outside of Senesh.png", "date": "2024-02-01 22:46:05.147374"}