{"title": "Cool Runnings", "article": "<b>Warning! There are spoilers!</b>\r\n\r\n<br><br>In this article, I will be reviewing the movie “Cool Runnings”. A movie based on a true story about how the country of Jamaica made it to the bobsledding Olympics, it has humor, seriousness, and overall greatness. I personally really enjoyed this movie for many reasons. First of all, the characters are really funny. Sanka Coffie, the brakeman, is the comic relief. He is the self-proclaimed best pushcart driver in all of Jamaica, and he is very funny. He carries around with him a lucky egg, which you kiss for good luck, or so he says. Derice Bannock, the main character, is the son of Ben Bannock, Olympic gold medalist in the 100 meter sprint. Derice fails while trying to make it into the sprinting Olympics, so he finds former bobsled medalist Irving Blitzer to teach him, Sanka Coffie, Junior Bevil, and Yul Brenner. These 4 Jamaicans form a bobsled team, which everyone ridicules them for. When they make it to the Olympics, every bobsled team makes fun of them. Germany, Switzerland, Russia, etc, etc. \r\n<br><br>At first, they are terrible, and they can’t even get in the sled. The coach is not optimistic, and tells everybody about the terrible dangers that come with bobsledding. Throughout the movie, he gets more comfortable with being the coach. The team gets better and makes it to the Olympics. On their final run, their sled breaks, throwing them off track, and the sled flips over. Now they are going ~80 mph on their helmeted heads. They stop just a few yards in front of the finish line. In the movie, the 4 bobsledders carry their sled to victory, but in real life, they just walked alongside it. Another cool thing about Cool Runnings is that they use actual footage from when the sled flips over. I can’t imagine how scary that must have been for the sledders. In real life, the sled doesn’t flip because of its poor condition, it flips because the driver was too inexperienced and they were going too fast for him. Overall, I think that this movie was fantastic. I would recommend it to whoever is reading this. 5 out of 5 stars. \r\n<br><br>I think that the humor is good too because Jamaica is a very hot, tropical country, and the 4 characters are not accustomed to the freezing Canadian temperatures at all. There is one scene where they see the -25℉, snowy Canadian outside, and Sanka runs back into the airport, puts on every single one of his layers, and is still shivering. \r\n<br><br>That’s my cover of the movie “Cool Runnings”.\r\n<br><br>", "author": "Marshall Friedman", "src": "artsandentertainment/imgs/Cool Runnings.webp", "date": "2024-04-18 22:31:08.961146"}