{"title": "The Death Run", "article": "CHALLENGE 1:\r\n<br>You're in a medieval prison cell. You only have a torch hanging by the wall. Guards approach the cell. They say the king will let you fight a vampire or a massive snake. If you live you’re free. \r\n<br><br>Do you choose the vampire or the snake?\r\n<br>#1: vampire\r\n<br>#2: snake\r\n<br><br>CHALLENGE 2:\r\n<br>You’re stuck in a rusty shed with a horde of zombies banging on the door. The only weapon you have is a flame thrower and a massive sword that can cut through dozens of zombies at a time. They're about to break the door down. Quick! Choose one.\r\n<br><br>Do you choose the flamethrower or the sword?\r\n<br>#1: flamethrower\r\n<br>#2: sword\r\n<br><br>CHALLENGE 3:\r\n<br>You're stuck in an arctic cave with only forward as a way out. You only have a bag of fish and a glass shield. There's a fork up ahead. On the right there is a cave full of polar bears and freezing cold water in a bunch of holes. On the left there is an ancient trap that will shoot icey spikes at you.\r\n<br><br>Do you go left or right?\r\n<br>#1: left\r\n<br>#2: right\r\n<br><br>CHALLENGE 4:\r\n<br>You've being chased at night by a group of giant venomous killer spiders. You're trying to get to home base. It's the only safe spot.You see a safe spot to hide in a shack. Just before you get in you get bitten. You find a chest in the shack. You have a few moments to rest before you have to escape through the back. In the chest there is medicine and a lightning bolt shooting bow. The spiders are just about to break in. quick! Grab one and run.\r\n<br><br>What do you take?\r\n<br>#1: lightning bolt shooting bow\r\n<br>#2: medecine\r\n<br><br>CHALLENGE 5:\r\n<br>You are trapped in a metal cage. You are being lowered into a pit about to be fed to a group of alien monsters as a sacrifice. All you have is a knife and a paperclip. There is a platform below you but above the aliens. If you can get to the platform you can escape and live. Suddenly a rock falls from up above making both items slip and nearly fall. If you grab one the other will fall off the vibrations. What do you pick?\r\n<br>#1: paperclip \r\n<br>#2: knife\r\n\r\n<br><br>Did you live? Find out below.\r\n<br><br>Challenge 1\r\n<br>Vampire: vampires die of light. You have a torch.\r\n<br><br>Challenge 2\r\n<br>Flamethrower: cutting a zombie in half will just make the top half and bottom half both come after you. And the fire will melt the rotting flesh.\r\n<br><br>Challenge 3\r\n<br>Right: you have a bag of fish. Distract the polar bears with the fish.\r\n<br><br>Challenge 4\r\n<br>Medicine: even if you kill the spiders, the poison will still kill you before you get to home base.\r\n<br><br>Challenge 5\r\n<br>Paperclip: you can pick the lock with the paperclip and trying to fight the aliens is pointless. After you pick the lock just jump to the platform", "author": "Maxwell Rothberger", "src": "artsandentertainment/imgs/The Death Run.jpeg", "date": "2024-05-13 17:10:08.318478"}