{"title": "Broadway", "article": "John Lahr, a theater critic, once said, “Broadway shows in New York draw two times the attendance of all New York sports teams put together.” 12.28 million people traveled to hear these famed voices perform. Broadway might be one of the most beloved attractions in NYC, but not many people know of its history.  \r\n<br><br>Broadway is a theater district that contains around 40 theaters. Theater in NYC started in the mid-1750s, but as New York was a vigorous workplace, many people had neither the time nor money to go see plays. The first true Broadway musical was shown in 1750. It was called The Beggar's Opera. Many of New York’s theaters were not much more than wooden houses at this time. This changed in 1798 when Mark Istembul Brunel designed the first major theater. Its first production was Shakespeare’s “As You Like It” on January 29, 1798. Soon Broadway theaters had evolved and grown to fit the times, performing comedies, silent pictures.\r\n<br><br> When the Great Depression hit Broadway, nearly 75% of all actors and producers quit. Classical theater was trumped by movies and many theaters were converted into movie theaters. Still, the actors of Broadway persevered, trying to make light of these hard times. After the Great Depression, ticket sales and interest in Broadway rose. Many things that make Broadway unique today came to be in this time period, such as fun dance routines, catchy lyrics, and shows such as Oklahoma.   \r\n<br><br>In the 1970s, Broadway had its second decline in popularity, but as it did before, it came back even stronger in the 80s with shows still popular today like Phantom of The Opera and Les Misérables. \r\n<br><br>Now, Broadway is a famed billion dollar industry. People use Broadway as a creative outlet and a way to bring diversity and light to the world of theater. Throughout history, Broadway has broken boundaries again and again, inspiring many people with the magic of theater.  The past of Broadway is as important as its present, for it shows the sheer determination and grit of the theater industry.", "author": "Ava Samuels", "src": "worldevents/imgs/Broadway.jpeg", "date": "2024-03-08 22:46:05.147374"}