{"title": "Grammys 2024 + Taylor Swift's Big Announcment", "article": "Did you watch the Grammys? If you didn’t, then don’t worry! Here is a summary of what happened.\r\n<br><br>On Saturday, February 4, 2024, the Grammys were hosted by Trevor Noah. If you don’t know what the Grammys are, they are awards for music. According to sources from CBS News, here are some of the stats:\r\n<br><br>Taylor Swift won the Grammy for “Album of the Year” with her album “Midnights”. Taylor also won a Grammy for best pop vocal album. She then told her audience that she was going to drop her next album, “The Tortured Poet’s Department” on April 19, 2024. \r\n<br><br>SZA (real name Solána Imani Rowe according to Wikipedia) was nominated for nine Grammys including album of the year, record of the year and song of the year. \r\n<br><br>The winners of each category were:\r\n<br><br>1. Miley Cyrus - Flowers (Best Pop Solo Performance)\r\n<br><br>2. Karol G - Mañana Será Bonito (Best Música Urbana Album)\r\n<br><br>3. SZA - Snooze (Best R&B Song)\r\n<br><br>4. Taylor Swift - Midnights (Best Pop Vocal Album)\r\n<br><br>5. \"What Was I Made For? – Billie Eilish O'Connell & Finneas O'Connell, songwriters (Song of the Year)\r\n<br><br>6. Victoria Monét - (Best New Artist)\r\n<br><br>7. Miley Cyrus - Flowers (Record of the Year)\r\n<br><br>8. Taylor Swift - Midnights (Album of the Year)\r\n<br><br>The biggest deal at this year’s Grammy awards was Taylor Swift’s announcement that she was releasing a new album. According to inc.com, “During her acceptance speech, Swift thanked her fans and shared how grateful she is to be doing what she does. \"All I want to do is keep being able to do this,\" Swift said. \"I love it so much. It makes me so happy.\"” inc.com then says “Earlier in the ceremony, however -- as she accepted the award for Best Pop Vocal Album -- Swift did something entirely unexpected. She announced the release of her 12th studio album, titled The Tortured Poets Department, coming April 19.” \r\n<br><br>Basically, this means that nobody expected Taylor to announce she was re-recording her “Reputation album, but she actually told them a little secret. Well, a secret she had been keeping for two years. Taylor’s words according to inc.com were \r\n<br><br>“\"OK, this is my 13th Grammy, which is my lucky number,\" Swift joked. \"I don't know if I've ever told you that. I want to say thank you to the members of the Recording Academy for voting this way, but I know that the way that the Recording Academy voted is a direct reflection of the passion of the fans. So I want to say thank you to the fans by telling you a secret that I have been keeping from you for the last two years, which is that my brand-new album comes out April 19th. It's called The Tortured Poets Department. I'm going to go and post the cover right now backstage. Thank you, I love you! Thank you!\"\r\n<br><br>So, that is my cover of the Grammys and Taylor Swift's big announcement.", "author": "Marshall Friedman", "src": "worldevents/imgs/Grammys 2024.webp", "date": "2024-02-01 22:46:05.147374"}