{"title": "Book Recommendations", "article": "Did you know that Americans read an average of 12 books a year? As an avid reader, I often find myself looking for a good book I can get lost in. Even if you aren’t a big reader, everyone can get lost in a good book! \r<br><br><b>One of Us is Lying</b> is a murder mystery book set in Bayview High. When the author of the school's notorious gossip app gets allegedly murder in detention. The four other teens in the room are shoved into a world of suspects, backstabbing, and gossip.\r<br><br><b>The Inheritance Games,</b> is about 16 year old Avery who lived a normal life in Connecticut, until a billionaire she never met dies and leaves her his fortune. Avery enters a new world and she's going to need all her wits to even survive…\r<br><br>The book <b>Eragon,</b> stars a boy ,Eragon, who finds an azure blue stone in the woods, he only expects to get enough food to feed his family through the winter.  Instead, a baby dragon hatches from the egg he found. He must take up the mantle of an age-old legion of warriors. With the help of an old storyteller, he must learn about his new found power and a dark truth about his world.\r<br><br><b>Keeper of The Lost Cities,</b> is about a 12 year old prodigy who has a power, a power she can never tell anyone. When she meets a mysterious boy, or so she thinks… He tells her that she is one of his kind. An elf. Now she must leave her family and join this seemingly perfect world. As she navigates this new world, she learns more about her new world and her past…\r<br><br><b>The Book Thief</b> is an unforgettable tale of love and loss narrated by Death. Liesel’s brother just died and her mom left her with a new family. Soon her new family decides to hide a Jew, Liesel starts to question everything and the only comfort she can find is in books that she steals. \r<br><br><b>World Made of Glass</b> is the story of Iris Cohen learning to use her voice. After her father is diagnosed with AIDs she learns how to stand up for what's right. How can she act normal, when her dad is dying of a virus that’s off-limits to talk about? When she knows that soon all she’ll have left of her kind and loving dad are memories, photos, and a binder full of the poems they used to exchange?\r<br><br><b>Attack of the Black Rectangles</b> is about the injustices of censorship in books. When a group of students find that a book that they are reading has blacked out words, they decide to take action and head to the principal's office to protest the censorship... but she doesn’t take them seriously. This book shows the power of words and even if the truth is hard it is worth fighting for. \r<br><br><b>A Rover’s Story</b> is an unusual story of a rover named Resilience, who despite  being a rover feels things he shouldn’t. This is the dual tale of Resilience’s adventure on Mars and a girl who writes letters to him, sharing all her hopes and worries. This is the powerful tale of love, loss, and  how hope withstand all. \r<br><br><b>Code Girls:</b> Young People's addition is the untold tale of the women code breakers of World War II. Their story is a forgotten tale of courage and bravery that many people don’t know about. These intelligent women shortened the war by 2 years by breaking complex codes. \r<br><br><b>The Rose Code:</b> Three women are struggling to find their purpose. Mab, a self made girl, wants to marry an interesting and smart man. Osla, the richest girl you might ever meet, wants to do something for WWII! And Beth, incredibly smart but reliant on her mother, wants to do nothing. They are all thrown together because they are exactly what Bletchley Park needs. They will face love, marriage, death, loss and code!\r<br><br>\r<br><br>", "author": "Ava Samuels", "src": "artsandentertainment/imgs/Book Recommendations.jpeg", "date": "2024-03-22 21:43:36.155417"}