{"title": "Ghostbusters: Frozen Empire", "article": "<b>WARNING! THERE WILL BE SPOILERS!</b>\r\n\r\n<br><br>In this article, I will be reviewing the new Ghostbusters: Frozen Empire movie.\r\n\r\n<br><br>Firstly, I would like to say that the plot was very interesting. The plot was basically that there is an orb that houses an ancient god. This God was long dormant, but then one of the humans awakened it by saying a special chant. The God emerged, and three of the old Ghostbusters plus Paul Rudd, Finn Wolfhard, Kumail Nanjiani, Carrie Coon, McKenna Grace and Celeste O’Connor team up and try to take down this ghost-god-ice monster-type thing.\r\n\r\n<br><br>While it was a little scary (hence the PG-13 rating), it was overall very funny and I loved it. Bill Murray aka Peter Venkman, one of the original Ghostbusters, never lost his sense of humor. Kumail Nanjiani, who played Nadeem Razmaati, a newer addition to the Ghostbuster crew, was a funny new person who also turned out to be a fire master. \r\n\r\n<br><br>To see some funny quotes from this movie, take a look at MovieQuotesandMore, a website that has some particularly funny quotes, especially from this movie. Here is one moment I found especially interesting to give an idea of what this movie has to offer.\r\n\r\n<br><br>Some background information: Ray Stanz, “the weird guy who buys strange things” runs a shop where he scans things that people bring in for supernatural emissions. Nadeem gives Ray his grandmothers orb that he found in the wall of his pantry. Ray calls the orb “interesting\" and wants to purchase it. Nadeem tells him he can have it for $40. Ray then says the ball was “unlike anything he had seen before.” Nadeem then says under his breath, “$60…” as a way to squeeze a little more money out of the sale. This scene is particularly funny because Nadeem is selling the last of his family heritage for sixty dollars, not realizing the true value of family history.\r\n\r\n<br><br>An interview with my brother Leo Friedman (3rd) revealed a lot. He also saw the movie, and he will share his opinions in a Q&A.\r\n\r\n<br><br>Q: What was your favorite part of the movie?\r\n\r\n<br>A: My favorite part of the movie was probably when they were waiting for the god Garraka to arrive and they got some of the original ghostbusters together.\r\n\r\n<br><br>Q: Why was this your favorite part of the movie?\r\n\r\n<br>A: This was my favorite part because you get to see what the old Ghostbusters look like.\r\n\r\n<br><br>Q: What was your least favorite part of this movie and why?\r\n\r\n<br>A: I disliked the middle of the movie the most because it was boring and not much interesting stuff happened.\r\n\r\n<br><br>Q: Who was your favorite character and why?\r\n\r\n<br>A: My favorite character was Nadeem Razmaati because of his humor and hilarity.\r\n\r\n<br><br>Q: Out of a 5 star rating, what would you give this movie?\r\n\r\n<br>A: ★★★☆☆\r\n\r\n<br><br>That’s my recap of this new ghostbusters movie! If you liked what you read, and want to see it, I definitely encourage you to. \r\n<br><br>", "author": "Marshall Friedman", "src": "artsandentertainment/imgs/Ghostbusters: Frozen Empire.jpg", "date": "2024-03-26 21:46:56.895806"}