{"title": "Mayan Money Man Story", "article": "Deep in the jungles of South America a lone explorer named John walked through the jungle. While walking he found another group of explorers. He asked them what they were doing.\r\n<br><br>The leader of the group, Wellson, replied. “We're looking for the ancient temple of Ka Kua. It's the temple of chocolate.”\r\n<br><br>“Why in the world would you want to find a temple of chocolate,” said John.\r\n<br><br>“Well . . . legend has it that if you can make it to the center of the temple there's a bar of chocolate that has a taste like nothing else in existence. And it's actually healthy,” Wellson answered. \r\n<br><br>“How does that help anything if there's only one of them,”John fired back.\r\n<br><br>“Well there’s actually infinite,” Wellson responded.\r\n<br><br>“Now that I think about it . . .” said John “I actually saw a temple with chocolate on the ruins not too far from here.”\t\t\t \r\n<br><br>“Wait,” said Wellson. “Did the chocolate appear any different from normal?”\r\n<br><br>“Actually it appeared to be shooting lightning out of it. It looked pretty legendary to me,” John said.\t \r\n<br><br>“Well let’s head over there,” said Wellson. And thus the explorers walked to the temple which actually turned out to be Ka Kua. As they approached the temple the ground began to shake and crumble. \r\n<br><br>“Woh!!!!” they all screamed. Suddenly a massive brown something leaped out of the ground and landed right in front of them. boom.. Then boom. Again. Two massive ten feet tall chocolate golems stood before them. If looks could kill those golems would have turned the men to dust and iron to liquid. Luckily looks can’t kill. \r\n<br><br>First, one of the explorers attacked one golem by eating it. He ended up getting punched into a tree 30 feet away. Ouch! Next another explorer pulled out a rifle and shot the other golem through the heart. Pow. \r\n<br><br>“Yes,” said the explorer. “Shot through the heart.” \r\n<br><br>“🎶And you're to blame🎶,” called out another explorer in a sing-song voice. Come on, said John as he stabbed one golem through the chest with his machete. \r\n<br><br>“Look,” Wellson cried. The entrance door had opened,  a dark, menacing inside . . . as the group (minus the man in the tree) walked through the temple they discovered a boiling waterfall of chocolate. “Well that’s not something you see every day,” said one of the other explorers. \r\n<br><br>“Duh.” called out another. \r\n<br><br>“Luckily I brought an umbrella in case of rain,”John said. He held the umbrella under the waterfall, clearing a path. A loud hissing sound filled the air. The umbrella was melting! \r\n<br><br>“Hurry!” Wellson cried out. The men ran in through the opening as fast as possible. John was barely able to jump through the hole before the umbrella was completely covered in boiling chocolate. \r\n<br><br>“That was a close one,” said a very agitated John. \r\n<br><br>“Alright!” said Wellson. “Let’s keep moving.”\r\n<br><br>“I wish we could,” said an explorer. A massive wall of chocolate stood in front of them blocking the path forward. \r\n<br><br>“So what do we do,” someone asked. \r\n<br><br>“We eat,” said another. And they began eating. \r\n<br><br>And that’s how they spent the rest of eternity. Because for every bite you take out of that wall one thousand more pieces appear.\r\n<br><br>\r\n<br><br>THE END", "author": "Maxwell Rothberger", "src": "artsandentertainment/imgs/Mayan Monkey Man Story.jpeg", "date": "2024-03-22 21:49:34.103272"}