{"title": "Metropolitan Diary Entries", "article": "This is a collection of stories that the writers of the Senesh Times wrote about their February Breaks. Please enjoy Wordle miracles, fish scares and Harry Potter exhibits.\r\n<br><br>Dear Diary,\r\nI was at Urban Air, on a sleepover with my best friend. We were jumping around and having a great time. We went into the car to do Wordle. I looked up and saw a sign saying, “Urban Air.” I zeroed in on the first word. Urban. I typed it into my phone and the five tiles flipped over, one by one. They were all green. I had won the Wordle in one guess. It was a New York miracle.\r\n<br><br>- Lukas Jones\r\n<br><br>---------------------------------------------------------------------\r\n<br><br>Dear Diary,\r\n<br><br>I was in Florida, and it was our last day there. We decided, because it was Florida, that we wanted to go to the beach. \r\n<br><br>When we arrived, it turned out that we were there during the annual turtle festival! This was not what we expected. So, instead of having a nice, calm beach day, we went on rides at the festival. It was definitely not the calm, last day we had planned for ourselves.\r\n<br><br>- Marshall Friedman\r\n<br><br>---------------------------------------------------------------------\r\n<br><br>Dear Diary, \r\n<br><br>I was on the beach and  I was swimming in the water. Just then I felt a tap on my leg. I jumped up into the air and quickly swam away. I turned back and it was just a little fish. In my mind I had pictured a huge shark but it really was just a fish no bigger than my finger. \r\n<br><br>- Ava Samuels \r\n<br><br>---------------------------------------------------------------------\r\n<br><br>Dear Diary,\r\n<br><br>This weekend I went to Long Island and on Sunday we went to Target. We went on a shopping spree and my brother spent $117 that he was saving for Billy Joel tickets on clothing and makeup! Meanwhile I was looking for the cleaning department in the target because I was on the hunt for my dream, the O-Cedar easywring bucket and mop with a rinsing half with a lever for the soapy water to come out of and a wringing half for making sure the mop wasn’t too wet.\r\n<br><br>I ended up begging my mom for this $25 mop and bucket set that she eventually got me. Once I got home I started the now only 15 minute process of cleaning the floors.\r\n<br><br>- Sam Weiner\r\n<br><br>---------------------------------------------------------------------\r\n<br><br>Dear Diary,\r\n<br><br>My dad and I were driving to Manhattan. When we arrived, we went to Koreatown. We walked past all of the restaurants until we found one serving  BBQ chicken. Afterwards, we walked to the Harry Potter Exhibition nearby. While walking, I saw a guy in the middle of the street yelling, “Yes! Yes! Keep going! You’re a natural!” to a woman that was dancing. She and some other guys did backflips and back handsprings. There was a very large crowd and people were recording.\r\n<br><br>My dad and I finally got to the Harry Potter Exhibit. It felt like the actual set of Harry Potter! I got to pick my house and wand and chose Gryffindor and the Elder Wand. There were four sections, one for each Hogwarts house (Ravenclaw, Hufflepuff, Slytheren, and Gryffindor). The exhibit also had the costumes that the actors wore in the movies, mainly the attire of Luna Lovegood, Cho Chang, Draco Malfoy, Scopius Malfoy, Harry Potter, Albus Potter, Hermione Granger, and Ron Weasley.\r\n<br><br>Visitors to the exhibit also got to make our own potions. I made the luck potion Felix Felicis. We also got to cast our own spells. We visited the Forbidden Forest and  Hagrid’s Shack! One of the exhibit’s sets contained the Marauder’s Map.  It had my name on it and those of a few other visitors. It was a New York dream!\r\n<br><br>- Noa Kamil\r\n<br><br>---------------------------------------------------------------------\r\n<br><br>Dear Diary,\r\n<br>\r\nComing back from Paris my mom had called our car and we had piled in when our driver started to speak in French! We tried to use Google Translate to converse and she told us she had accidentally canceled our ride! She said, “I will call my assistant Huber,” which turned out to be the Uber Assistant (not Assistant Huber.) The assistant did not speak English very well but our driver drove us to the airport while the assistant and my mom conversed. They tried to fix the problem many ways but finally we left a tip for 20 euros and we gave her a 20 dollar bill for her to convert to euros! We got out of the car and walked into the terminal in order to find out that we were in the wrong one and that our flight was boarding!\r\n<br>- Adam Bellows\r\n", "author": "The Senesh Times Writers", "src": "artsandentertainment/imgs/Metropolitan Diary Entries.jpeg", "date": "2024-03-08 22:46:05.147374"}