{"title": "Premier League Title Race and Relegation Battle", "article": "As the Premier League comes to its final quarter there is an exciting title race and relegation battle. The teams that  might win the league are Liverpool, Manchester City and Arsenal. The teams that are fighting to stay in the Premier League are Sheffield United, Burnley, Luton, Nottingham Forest and Everton. (three of these teams will be relegated) I will give an in-depth analysis of each team's chance of winning the title or getting relegated.\r<br><br><b>Title Race</b>\r<br><br>Manchester City: \r<br><br>Man City have won the last three Premier League Campaigns and they are the favorites to win it again this year. According to Telegraph UK they have a 46% chance of winning. Although they are in third place they are one point behind top spot Arsenal. Additionally, Man City have one 5 out of the last 6 Premier League Titles.\r<br><br>Liverpool:\r<br><br>The Reds are having an astonishing season with 19 wins and are currently sitting in second place ahead of the reigning champions Manchester City. This year Liverpool have had many bright lights such as veteran Mohammed Salah, Luis Diaz, Dominik Szoboszlai and youngster Connor Bradley. At the end of the campaign, Jurgen Klopp, the manager of Liverpool for eight seasons, announced that he will be leaving the club. So this will motivate the players into making their industrious coach proud by ending the season with silverware.\r<br><br>Arsenal: \r<br><br>Mikel Arteta’s squad have been arguably the best team in the world lately, winning their last seven Premier League matches and into the quarter finals of the UEFA Champions League. The Gunners have a 27% chance of winning the title. As the season progresses Arsenal fans will hope they will pull through unlike last year when they bottled the league to Man City.\r<br><br>Relegation Battle\r<br><br>Luton Town:\r<br><br>Luton Town's promotion to the Premier League has been a historic achievement, but their displays in matches this season are not so spectacular. The Hatters have just five wins in twenty nine games and their chances of staying in the Premier League are very slim. Along with an injury crisis, this has made Luton look weak. They have to rely on last minute equalizers to stand a chance of surviving.\r<br><br>Burnley:\r<br><br>Burnley’s season has been characterized with poor and inconsistent performances and difficulty in earning points.Their lack of offensive and defensive power has resulted in just four wins. Although they have experienced and talented players, this has not made a difference as they sit in nineteenth place and are staring down at relegation. \r<br><br>Sheffield United:\r<br><br>The Blades sit last place in the Premier League and have a 98% chance of relegation into the EFL Championship (BBC). Sheffield United have a negative fifty goal differential and do not look like they can change anytime soon. Due to their poor management and terrible defense, they will have a historically terrible season.  \r<br><br>Nottingham Forest:\r<br><br>This season the tricky trees have been below par and their on field performances have been embarrassing. Although the players have not been playing well, it is not entirely their fault. Due to their owners poor bookkeeping, they were deducted four points for violating financial fair play and sustainability rules.  Forrest are sitting eighteenth place and have to work hard to stay in the Premier League.\r<br><br>Everton:\r<br><br>The Evertonians have had a mixed season showing some moments of brilliance but mostly bad performances. They faced being deducted six points for violating financial fair play and sustainability rules. Additionally, they have had many injury setbacks and are most likely going to end the season in sixteenth but are possibly going to go down in the lower league.\r<br><br>", "author": "Jake Weiss", "src": "sports/imgs/Premier League Title Race and Relegation Battle.avif", "date": "2024-03-22 21:47:17.493589"}