{"title": "Amai Ba", "article": "In this article, I am going to talk about the recently-opened ice cream shop named “Amai Ba”, and I will include an interview with the owner and founder named Arpana. Located on 70 Henry Street, this is one of my go-to ice cream places whenever I am offered. I also love taking my friends there whenever I have friends over. One of my favorite things about this place is their ever-changing menu. They have a variety of flavors, each one incredible in its own way. My favorites include:\r<br><br>\r<br><br>Twisted Rocky Road\r<br><br>Ice cream: Swirl (chocolate, vanilla)\r<br><br>Incorporated toppings: Peanuts, chocolate chips\r<br><br>Recommended added toppings: Whipped cream\r<br><br>Why: I really like its flavor, and the added crunch you get with the peanuts and chocolate chips really makes it better.\r<br><br>Monkey Business\r<br><br>Ice cream: Swirl (chocolate, vanilla)\r<br><br>Incorporated toppings: macadamia nuts, banana flavoring\r<br><br>Recommended added toppings: Whipped cream\r<br><br>Why: I don’t usually like banana, but Amai Ba finds a way to make it into ice cream that makes it delicious.\r<br><br>Pumpkin Spice\r<br><br>Ice cream: Pumpkin\r<br><br>Incorporated toppings: N/A\r<br><br>Recommended added toppings: chocolate sprinkles, chocolate sauce, chocolate sprinkles and whipped cream together\r<br><br>Why: It’s perfect for the season they sell it in, and the color is aesthetically pleasing.\r<br><br>Vanilla\r<br><br>Ice cream: Vanilla\r<br><br>Incorporated toppings: N/A\r<br><br>Recommended added toppings: N/A\r<br><br>Why: Two reasons. One, it is one of the rare flavors that is better with no toppings. Two, it is award winning! It was ranked 3rd best on a rating app.\r<br><br>Oreo Delight\r<br><br>Ice cream: Vanilla\r<br><br>Incorporated toppings: Oreo crumble\r<br><br>Recommended added toppings: Rainbow sprinkles, whipped cream\r<br><br>Why: This ice cream is usually in season and is one of my favorites overall.\r<br><br>(Interview with Leo Friedman, 3rd) Strawberry Shortcake \r<br><br>Ice cream: Swirl (strawberry, vanilla)\r<br><br>Incorporated toppings: N/A\r<br><br>Recommended added toppings: Chocolate sauce\r<br><br>Why: “I like how the flavors are mixed together, and the color is really beautiful too.” (Leo)\r<br><br>\r<br><br>\r<br><br>Another great reason to come to Amai Ba is because of the things that aren’t ice cream. They have delicious pastries like muffins, danishes and fritters. Furthermore, the people there are very bright. They make great ice cream, and they are very friendly. Another thing I like about Amai Ba is the things they make beforehand. In the fridge, they have ice cream sandwiches with homemade cookies and ice cream. They also sell pints of ice cream, in case you have company. \r<br><br>\r<br><br>Finally, a great thing about this place is their decorations. They draw on their windows based on the season. For example, during halloween, they put caution tape on their doors, and draw ice cream cones and coffee cups dressed up as different things. One example, and one of my personal favorites, is their ice cream cone dressed up as Harry Potter. They drew a face on it and gave it a lightning bolt scar and a wand. These are most of the reasons why I love Amai Ba.  \r<br><br>\r<br><br>\r<br><br>\r<br><br>Interview with Arpana\r<br><br>\r<br><br>1: What made you want to start a business?\r<br><br>“My dad actually owned Carvel. We still own 2 on Long Island, so I’ve been around ice cream since 3rd grade.”\r<br><br>\r<br><br>\r<br><br>2: What made you want to make ice cream? Were there any other ideas you had that didn’t happen?\r<br><br>“Not really. I’ve always been into culinary, and dessert, and ice cream really matched those. Also because my family owned Carvel.”\r<br><br>\r<br><br>\r<br><br>3: What is your favorite part of owning Amai Ba?\r<br><br>“I am my own boss.”\r<br><br>\r<br><br>4: What is your personal favorite ice cream flavor?\r<br><br>“Matcha Chip.”\r<br><br>\r<br><br>5: What does Amai Ba mean, and why did you choose it as your store name?\r<br><br>“Amai Ba means “sweet bar” in Japanese, and my father-in-law went to high school and college in Japan, so it is kind of a nod to my father-in-law, and also a nod to ice cream.”\r<br><br>\r<br><br>\r<br><br>6: What is your favorite thing in your store that isn’t ice cream?\r<br><br>“Your family. You guys were one of my first customers, and I really appreciated that.”\r<br><br>\r<br><br>\r<br><br>7: Are there any new flavors that you are thinking of making?\r<br><br>“I’m thinking of doing a Thai Tea flavor.”\r<br><br>", "author": "Marshall Friedman", "src": "artsandentertainment/imgs/Amai Ba.jpeg", "date": "2024-05-30 23:06:14.439766"}