{"title": "April Holidays", "article": "April is famous for many things. April Fools, and the saying “April Showers bring May flowers!” But what you probably didn’t know is that April brings much more! Read more to see April holidays.\r\n<br><br>April 1st: Edible book day (AKA eat more candy) \r\n<br><br>April 2nd: National Ride Your Horse to a Bar Day. Okay, who is making these holidays up? Ride your horse to a bar? That is so specific, it is almost impossible. If you are reading this on April 2nd, and you own a horse, ride it to a bar, I guess…\r\n<br><br>April 3rd: National Find a Rainbow Day.\r\n<br><br>April 4th: National Burrito Day. For all those Mexican food lovers or burrito lovers, this is your day!\r\n<br><br>April 5th: National Peeps Day. A peep is a marshmallow coated in sugar. Some people do “Peep Wars” where you put two peeps in a microwave with toothpicks, and whichever peep stabs the other first wins. Try it!\r\n<br><br>April 6th: International Pillow Fight day! Another pajama day, anyone? 😜\r\n<br><br>April 7th: National Coffee Cake Day. Who likes coffee? Who likes cake? Coffee cake is nothing like either of those things!\r\n<br><br>April 8th: National Dog Fighting Awareness Day. Be aware! Humans aren’t the only thing that fight. \r\n<br><br>April 9th: National Make Up A Name For Yourself Day. Make up a name for yourself today and make everybody call you that! (by all means necessary.)\r\n<br><br>April 10th: Hug Your Dog Day. If you have a dog (of huggable size) hug them! They are cute. If you don’t have a dog, please disregard.\r\n<br><br>April 11th: National Submarine Day. Do you own a submarine? Probably not.\r\n<br><br>April 12th: National Kids Who Are 12 Years Old Day. Are you 12? If you are in 6th or 7th (or maybe 8th) grade, and you are 12, today is your day! You are in command (teachers probably won’t be to happy though 😜)\r\n<br><br>April 13th: National Silly Earring Day. If you wear earrings, maybe buy a funny one to celebrate today’s holiday!\r\n<br><br>April 14th: America’s Day. \r\n<br><br>\r\n<br><br>Ohhhhhh say can you seeeeeeeeeee?\r\n<br><br>Byyyyyyy the dawn’s early liiiiiiiiiiiiiiiiight.\r\n<br><br>What so proooudly we haaaaaaiiiiil’d.\r\n<br><br>At the twilight’s last gleamin’.\r\n<br><br>Whose broad stripes and bright staaaaaaars.\r\n<br><br>Through the perilous fiiiight.\r\n<br><br>O’er the raaaaaamparts we watched.\r\n<br><br>Were so gallantly gleaming.\r\n<br><br>(Here’s everyone’s favorite part)(sing in a really high key) And the rockets red glaaaaaaaaare!\r\n<br><br>The bomb bursting in aaaaaaaair!\r\n<br><br>Gave prooooof through the niiiight.\r\n<br><br>That our flag was still there.\r\n<br><br>Oh say does that star spangled baaaAAAner yet waaaaaave.\r\n<br><br>O’er the laAnd of the freeeeeeeeeeeeeeeeeeeeeeEEEEEEEEEEEEEEEEEEEEeeeeeeee!\r\n<br><br>And the home… of the braaaaaaaaaaaaaaaaaaaaeeeeeeeeevvvvvveeee.\r\n<br><br>—How every singer sings the national anthem.\r\n<br><br>\r\n<br><br>April 15th: National Anime Day. All you anime lovers, today is the day to celebrate you! If you don’t like anime, or don’t know what it is, this is not your day.\r\n<br><br>April 16th: National Cash Day. Spend cash! (That’s all I have to say)\r\n<br><br>April 17th: Blah Blah Blah Day. I think this day kind of speaks for itself 😜\r\n<br><br>April 18th: National High-Five Day. Give someone a high-five! It makes people happy (I think)\r\n<br><br>April 19th: National Poker Day. It’s a K-8th school! We gamble on poker, right? \r\n<br><br>April 20th: National Appreciate Your Husband Day. We are middle schoolers. Please disregard, April 20th has no good holidays\r\n<br><br>April 21st: National Chocolate-Covered Cashews Day. Cashews are delicious. Chocolate is delicious. Put them together and what do you get? Delicious.\r\n<br><br>April 22nd: National Jelly Bean Day. Jelly beans rock. What is the best flavor? Who knows?\r\n<br><br>April 23rd: World Book Day and World Book Night. Bibliophiles, you have 24 hours to do exactly what your favorite thing is. READ!!!\r\n<br><br>April 24th: National Denim Day. Denim is what jeans are made of. Wear jeans, a jean jacket, denim anything to celebrate this holiday.\r\n<br><br>April 25th: World Penguin Day. We ❤ Penguins\r\n<br><br>April 26th: Hug an Australian Day. Middle schoolers, hug Lauren, Tracy, or another Australian in your class.\r\n<br><br>April 27th: International Macaroni Day. Who doesn’t love macaroni and cheese? \r\n<br><br>April 28th: National Superhero Day! Gain superpowers! Super easy!\r\n<br><br>April 29th: National Zipper Day. Sweaters have zippers, some pants have zippers, if you have one of those things, wear it!\r\n<br><br>April 30th: National Adopt a Shelter Pet Day. Shelter pets have needs too! Adopt one! (not really!)\r\n<br><br>I have now supplied you with a list of 30 days of holidays and my thoughts on them. I hope you get to celebrate at least one of them.", "author": "Marshall Friedman", "src": "artsandentertainment/imgs/April Holidays.jpg", "date": "2024-03-13 22:58:31.776251"}