{"title": "Godzilla x Kong: The New Empire", "article": "In this article I will be talking about the latest godzilla film godzilla x kong the new empire. Well first I want to talk about the kaijus (the Japanese word for titans) I think they really put their best work into this movie. I mean I have to admit the scene where Kong slams scar king onto the ground after he got frozen by shimo was spot on. But the scene that now is a meme is pretty hilarious because when Kong came to Egypt to ask Godzilla for help, Godzilla just started attacking Kong right when he saw him and Kong did the meme. He put his hands out in front of him and made the wait no i’m not here to fight face if you want to see that go check it out on youtube or google.\r<br><br>\r<br><br>I also thought it was really cool how they brought Mothra back. But my real question is are there going to be anymore movies? After some thinking I figured if there was going to be another movie Ghidorah would have to come back right? Wait did Ghidorah die back in 2019 when Godzilla went thermonuclear. Well I'm pretty sure he did but maybe he didn’t because king Ghidorah did get his head ripped off but maybe he could’ve survived. Anyway I think there should be another movie but now let’s move on to Hollow earth. I think Hollow earth is a very interesting place. I mean we know Kong lives in Hollow earth. But we need to see more of it. Maybe there are some kaijus we don’t know of. Now let’s talk about the main people. Kaylee Hottle (Jia) I thought Kaylee really played her part well and I loved the scene where she summoned Mothra. I think it’s cool how she uses sign language in the movie and in real life.\r<br><br>\r<br><br>Ok next up is Rebecca Hall (Dr. Ilene Andrews) I think she did some pretty good acting. I mean that's all I really have to say because she was spot on and there were no specific scenes that she did well. Last but not least my personal favorite Brian Tyree Henry (Bernee Hayes) I like him only because he was the most hilarious actor especially in the scene where he was in the aerial vehicle and then when he started screaming because it was so fast. Well that’s it for today thanks for reading my review of Godzilla x Kong the new empire.", "author": "Greyson Geldwerth", "src": "artsandentertainment/imgs/Godzilla x Kong: The New Empire.jpg", "date": "2024-06-05 20:43:05.927263"}