{"title": "May Holidays", "article": "In this issue, Marshall, Noa and Lukas are going to be covering the national holidays of the month of May, also known as the Arthritis Awareness Month, Better Sleep Month, Mental Health Awareness Month, National Walking Month, and Women's Health Care Month. We are each going to pick a national holiday for each day and give a short 1-2 sentence summary  about what we think about it.\r<br><br>\r<br><br>May 1: Global Principal’s Day! Calling you out Nicole! Enjoy this day for yourself!\r<br><br>\r<br><br>May 2: Harry Potter Day. According to Ava Samuels (6th), The Battle of Hogwarts happened on May 2nd.\r<br><br>\r<br><br>May 3: National Paranormal Day. Lukas Jones (6th) says that National Paranormal Day exists because of Ghostbusters. No comment. According to Google “Each year on May 3rd National Paranormal Day people who believe in paranormal activities are encouraged to get together and share their experiences with each other.”\r<br><br>\r<br><br>May 4: And of course, May the Fourth Be With You \r<br><br>\r<br><br>May 5th: National Cartoonists Day. Many people love writing cartoons. If you don’t want to, read a comic book or a graphic novel. (I’ve been told there’s a difference. ¯\\_(ツ)_/¯ )\r<br><br>\r<br><br>May 6th: National Beverage day. Let's make the teachers buy us a vending machine \r<br><br>ᕦ( ⊡ 益 ⊡ )ᕤ\r<br><br>\r<br><br>May 7th: World Asthma Day. According to me (Noa Kamil) World Asthma Day exists because it's to spread awareness about asthma and for the people who have asthma (also me ;)).\r<br><br>\r<br><br>May 8th: National Give Someone a Cupcake Day. TEACHERS!!! HELLO!!!\r<br><br>\r<br><br>May 9th: World Donkey Day\r<br><br> Hee Haw\r<br><br>\r<br><br>May 10th: National Shrimp Day. Since we are kosher, we cannot celebrate this, but if you don’t keep kosher at home, eat shrimp!\r<br><br>\r<br><br>May 11th: Calling out all those foodies! It’s National Eat Anything You Want Day!\r<br><br>\r<br><br>May 12th: National Nutty Fudge Day. Yay Chocolate!\r<br><br>\r<br><br>May 13th: International Hummus Day. Hummus is great, and Israeli Hummus is even better! Fun fact; hummus is made of beans.\r<br><br>\r<br><br>May 14th: Dance Like A Chicken Day\r<br><br>\r<br><br>May 15th: Peace Officers Memorial Day.\r<br><br>\r<br><br>May 16th: National Drawing Day. We have many talented artists in our Senesh school, so today is the day to celebrate them.\r<br><br>\r<br><br>May 17th: National Idaho day. Potatooooooo.\r<br><br>\r<br><br>\r<br><br>May 18th: Reeses Cup day\r<br><br>\r<br><br>May 19th: This day has absolutely no good or relevant holidays, so disregard this.\r<br><br>\r<br><br>May 20th: National Defense Transportation Day! \r<br><br>\r<br><br>May 21st: World Day for Cultural Diversity for Dialogue and Development\r<br><br>\r<br><br>May 22nd: World Goth Day. Goth, not to be mistaken with emo, basically means that you are dark and your aura is “dingy”.\r<br><br>\r<br><br>May 23rd: National Taffy day\r<br><br>\r<br><br>May 24th: National Brother’s Day! Calling all brothers big or small! This is your day to stand out!\r<br><br>\r<br><br>May 25th: National Geek Pride Day. Geeks of all kinds, come out of your hiding place! You are a geek if you are obsessed with something. Computers, sports, math, anything.\r<br><br>\r<br><br>May 26th: For all those red heads out there…World Red Head Day! Since we have a lot of red heads in Senesh, make sure we celebrate them today!\r<br><br>\r<br><br>May 27th: National Sunscreen Day! Come on, all moms will love this day ;)\r<br><br>\r<br><br>May 28th: National Brisket Day. Brisket is incredible. That is opinionated though.\r<br><br>\r<br><br>May 29th: National Paperclip Day! Cmon teachers! Get those paperclips!!\r<br><br>\r<br><br>May 30th: National Creativity Day! Bring on your creativity!! \r<br><br>\r<br><br>May 31st: World No Tobacco Day. This is actually a very important day. Smoking is a very dangerous habit and kills over 480,000 people per year. (>៱<)", "author": "Noa Kamil, Marshall Friedman, Lukas Jones", "src": "artsandentertainment/imgs/May Holidays.jpeg", "date": "2024-05-10 00:29:36.912991"}