{"title": "Willy Wonka", "article": "Warning: there are a few spoilers!\r\n<br><br>The latest Willy Wonka movie was created pretty recently and here I will be sharing my honest opinion. First I have to say the movie had amazing graphics. My rating would probably be 10/10, it was really nice. I think the acting was spot on. They did a solid job on the singing and music. But personally my favorite actor was Timothee Chalemet. He really made the movie better. Ok now we're going to talk about some of the scenes. Well, first I have to give credit to the chocolate tree scene. Let me show you why.\r\n<img src=\"artsandentertainment/imgs/Screenshot 2024-05-09 8.24.21 PM.png\" width=\"50%\"/>\r\n<br><br>It’s not the full view but I hope you get what I mean. The tree just looks incredible. \r\n<br><br>But one of the scenes that really got to me was the briefcase scene. Here have a look.\r\n<img src=\"artsandentertainment/imgs/WWGG2.jpeg\" width=\"50%\"/>\r\n<br><br>So it turns out google had no good images of the magic briefcase buT if you watch the movie you will know what I mean. Anyways let’s move on and talk about Hugh Grant (the oompa loompa) . I think Hugh Grant really played the oompa loompa well and I loved how he saved them near the end at the drowning in chocolate scene. I also love the oompa loompa song. Now let’s bring up Keegan-Michael Key (chief of police) Keegan did a nice job being chief. But I have to admit my favorite part with him was probably eating too many chocolates. Yeah I think that’s enough for Keegan right now. Let’s move on to Tom Davis and Olivia Colman (Mr. and mrs. scrubbit). They were pretty good for their part. I mean they acted like cruel people. Lastly, we are going to talk about Calah Lane (Noodle) . I think she really acted like a calm girl who just needed a family. I also think she acted very well with Timothee. Well thanks for listening to my review of Wonka.", "author": "Greyson Geldwerth", "src": "artsandentertainment/imgs/Willy Wonka.jpeg", "date": "2024-05-10 00:21:55.266296"}