{"title": "Pride Month!", "article": "Pride Month—more commonly known as June—is a celebration of LGBTQIA+ people. LGBTQIA is a shortened version of LGGBDTTTIQQAAPP+, which stands for Lesbian, Gay, Genderqueer, Bisexual, Demisexual, Transgender, Transsexual, Twospirit, Intersex, Queer, Questioning, Asexual, Allies, Pansexual, Polyamorous and more. Usually people express this by wearing the colors of the pride flag which are red, orange, yellow, green, blue, purple, and sometimes white, brown, black and pink. Conducting an interview with 14 other children in the Senesh Times, 4 said they do identify with the LGBTQ+ acronym, and 10 said they do not. Pride month is also used to remember the bad things that happened to LGBTQ+ people just because of what they are. One of these famous events is the Stonewall Inn. A six-day battle between LGBTQIA+ people and the police, LGBTQ+ people won and kept the bar. Many people refer to the Stonewall event as a “riot” or a series of riots. Many Stonewall residents say they prefer the term “uprising” or “rebellion”. (information from guides.loc.gov) Nowadays, people are slowly progressing towards a more equal world for LGBTQ+ people. Sadly, some people still are bullied and cyberbullied for being gay, lesbian or other. Some people aren’t doing things themselves, but are donating to places that do help, such as the Ali Forney Center, The Anti-Violence Project, or the Brooklyn Community Pride Center. \r\n<br><br>Many people have questions about what the letters in the LGGBDTTTIQQAAPP+ acronym mean, so here is a brief summary of what each letter means. \r\n<br><br>L: Lesbian. Lesbian is a term for a woman who likes another woman.\r\n<br>G: Gay. Gay is an umbrella term for someone who likes the same gender as them. It can also mean a man who likes another man.\r\n<br>G pt. 2: Genderqueer. More commonly known as “non-binary”, Genderqueer is a term for someone who doesn’t feel like they fit in with either “boy” or “girl”.\r\n<br>B: Bisexual. Bisexual or for short “bi”, means you like both people who identify as both male or female.\r\n<br>D: Demisexual. Demisexual means you only like someone once you get to know them really well and you have an emotional bond with them.\r\n<br>T: Transgender. Transgender or “trans” for short, means you identify with the gender you weren’t assigned with during birth. Many people get confused with trans boy and trans girl. Trans boy means you were assigned a girl at birth and feel like a boy. Trans girl is the opposite.\r\n<br>T pt. 2: Transsexual. Transsexual—not to be confused with transgender means you are a transgender person who has undergone gender reassignment surgery.\r\n<br>T pt. 3: Twospirit. Twospirit is a Native American term where Native Americans felt like both a man and a woman and did the work of both of them. For example, a twospirit person would both go hunting like a man would, and cook like a woman would.\r\n<br>I: Intersex. Intersexual is a term for people who have genitals, chromosomes or reproductive organs of both a male person and a female person.\r\n<br>Q: Queer. A term that was past used as a derogatory term, Queer means you don’t feel cisgender or heterosexual either.\r\n<br>Q pt. 2: Questioning. Questioning means you are still figuring out whether you fit into the LGBTQ+ community or not.\r\n<br>A: Asexual. A term used to describe someone who doesn’t have sexual attractions to anyone. Its partner, Aromantic means you don’t have romantic attractions to anyone.\r\n<br>A pt. 2: Allies. Allies mean you are allied with people who are LGBTQIA+.\r\n<br>P: Pansexual. Pansexual means you have sexual attractions to people of all genders binary and non-binary.\r\n<br>P pt. 2: Polyamorous. Polyamorous means you have relationships with many people with the consent of everybody in all your relationships.\r\n\r\n<br><br>Of course this does not come close to naming everything somebody might feel as a person, but it is some that people have identified throughout years. \r\n<br><br>", "author": "Marshall Friedman, Lukas Jones, Noa Kamil", "src": "worldevents/imgs/Pride Month!.webp", "date": "2024-05-07 21:33:14.887338"}